#include <stdio.h>
#include <stdlib.h>


int main() {
	char ch;
	printf("문자를 입력하세요");
	ch = getchar();
	putchar(ch);
	printf("%c %d\n",ch,ch);
	return 0;
}
//--------------------------------------------------------------------------------------------------------------------+
int main() {
	char word[20];
	printf("단어를 입력하세요 : ");
	scanf("%s",word);
	printf("입력하신 단어는 %s 입니다",word);
	return 0;
}
//--------------------------------------------------------------------------------------------------------------------
int main() {
	char sentence[80];
	puts("문장을  입력하세요 : ");
	gets(sentence);
	printf("%s", sentence);
	return 0;
}
//--------------------------------------------------------------------------------------------------------------------
int main() {
	char c;
	scanf("%c",&c);
	if (c>=65 && c<=90)
	{
		printf("%c",c+32);
	}
	else if(c>=97 && c<=122)
	{
		printf("%c",c-32);
	}
}
//---------------------------------------------------------------------------------------------------------------------
int main() {
	char i;
	for(i=65;i<=90;i++)
	{
		printf("%c", i);
	}
	for(i=97;i<=122;i++)
	{
		printf("%c", i);
	}
}
//--------------------------------------------------------------------------------------------------------------------
int main() {
	char word[48];
	int i;
	scanf("%s",word);
	while (word[i]!=0){
		if (word[i]>=65 && word[i]<=90)
	{
		printf("%c",word[i]);
	}
	else if(word[i]>=97 && word[i]<=122)
	{
		printf("%c",word[i]-32);
	}
	i++;
	}
}
//--------------------------------------------------------------------------------------------------------------------
int main() {
	char sentence[80];
	int i,count=1;
	puts("문장을  입력하세요 : ");
	gets(sentence);
	while(sentence[i]!=0)
	{
		if(sentence[i]==32)
		{
			count++;
		}
		i++;
	}
	printf("%d",count);
	return 0;
}
//--------------------------------------------------------------------------------------------------------------------
int main() {
	char sentence[80];
	int i;
	puts("문장을  입력하세요 : ");
	gets(sentence);
	while(sentence[i]!=0)
	{
		i++;
	}
	printf("%d",i);
	return 0;
}
